SpenceKonde/ATTinyCore/tiny/bootloaders/optiboot/optiboot.c
/**********************************************************/
/* Version Numbers!                                       */
/*                                                        */
/* Arduino Optiboot now includes this Version number in   */
/* the source and object code.                            */
/*                                                        */
/* Version 3 was released as zip from the optiboot        */
/*  repository and was distributed with Arduino 0022.     */
/* Version 4 starts with the arduino repository commit    */
/*  that brought the arduino repository up-to-date with   */
/* the optiboot source tree changes since v3.             */
/*                                                        */
/**********************************************************/

/**********************************************************/
/* Edit History:                                          */
/*                                                        */
/* 4.5 TomC  : Fixed the software UART code so it actually*/
/*             works. Added support for Tiny84/85 (works).*/
/*             Added the ability to use RS484 with a chip.*/
/*             Converted some code to use Unions to reduce*/
/*             size considerably - tiny=576B, uno=480B.   */
/* 4.4 WestfW: add initialization of address to keep      */
/*             the compiler happy.  Change SC'ed targets. */
/*             Return the SW version via READ PARAM       */
/* 4.3 WestfW: catch framing errors in getch(), so that   */
/*             AVRISP works without HW kludges.           */
/*  http://code.google.com/p/arduino/issues/detail?id=368n*/
/* 4.2 WestfW: reduce code size, fix timeouts, change     */
/*             verifySpace to use WDT instead of appstart */
/* 4.1 WestfW: put version number in binary.          */
/**********************************************************/

#define OPTIBOOT_MAJVER 4
#define OPTIBOOT_MINVER 5

/*
#define MAKESTR(a) #a
#define MAKEVER(a, b) MAKESTR(a*256+b)
asm("  .section .version\n"
    "optiboot_version:  .word " MAKEVER(OPTIBOOT_MAJVER, OPTIBOOT_MINVER) "\n"
    "  .section .text\n");
*/
//It takes no extra memory (either flash or ram) to do it this way, but it means the address of the version number is known
#ifdef USE_TINY_TUNER
const unsigned char ver[4] __attribute__ ((section (".version"))) = {0xFF, 0xFF, OPTIBOOT_MINVER, OPTIBOOT_MAJVER};
#else
const unsigned char ver[2] __attribute__ ((section (".version"))) = {OPTIBOOT_MINVER, OPTIBOOT_MAJVER};
#endif
    
#include <inttypes.h>
#include <avr/io.h>
#include <avr/pgmspace.h>

// <avr/boot.h> uses sts instructions, but this version uses out instructions
// This saves cycles and program memory.
#include "boot.h"


#ifdef RS485_SUPPORT
#include <util/delay.h>
#endif

// We don't use <avr/wdt.h> as those routines have interrupt overhead we don't need.

#include "pin_defs.h"
#include "stk500.h"

#ifndef LED_START_FLASHES
#define LED_START_FLASHES 0
#endif

#ifdef LUDICROUS_SPEED
#ifdef BAUD_RATE
//Fix warnings about BAUD_RATE being redefined.
#undef BAUD_RATE
#endif
#define BAUD_RATE 230400L
#endif

/* set the UART baud rate defaults */
#ifndef BAUD_RATE
#if F_CPU >= 8000000L
#define BAUD_RATE   115200L // Highest rate Avrdude win32 will support
#elsif F_CPU >= 1000000L
#define BAUD_RATE   9600L   // 19200 also supported, but with significant error
#elsif F_CPU >= 128000L
#define BAUD_RATE   4800L   // Good for 128kHz internal RC
#else
#define BAUD_RATE 1200L     // Good even at 32768Hz
#endif
#endif

/* Switch in soft UART for hard baud rates */
#if (F_CPU/BAUD_RATE) > 280 // > 57600 for 16MHz
#ifndef SOFT_UART
#define SOFT_UART
#endif
#endif

#if defined(SOFT_UART) && defined(RS485_SUPPORT)
#undef SOFT_UART
#endif

/* Watchdog settings */
#define WATCHDOG_OFF    (0)
#define WATCHDOG_16MS   (_BV(WDE))
#define WATCHDOG_32MS   (_BV(WDP0) | _BV(WDE))
#define WATCHDOG_64MS   (_BV(WDP1) | _BV(WDE))
#define WATCHDOG_125MS  (_BV(WDP1) | _BV(WDP0) | _BV(WDE))
#define WATCHDOG_250MS  (_BV(WDP2) | _BV(WDE))
#define WATCHDOG_500MS  (_BV(WDP2) | _BV(WDP0) | _BV(WDE))
#define WATCHDOG_1S     (_BV(WDP2) | _BV(WDP1) | _BV(WDE))
#define WATCHDOG_2S     (_BV(WDP2) | _BV(WDP1) | _BV(WDP0) | _BV(WDE))
#if defined(__AVR_ATmega162__) || defined(__AVR_ATmega8__) 
#else
#define WATCHDOG_4S     (_BV(WDP3) | _BV(WDE))
#define WATCHDOG_8S     (_BV(WDP3) | _BV(WDP0) | _BV(WDE))
#endif

#ifdef USE_TINY_TUNER
#define BOOTLOADER_SECTION __attribute__((section(".bootloader")))
#define BOOTLOADER_START_SECTION __attribute__((section(".bootloader.start")))
/*When using tiny tuner, stdlib is required, but we don't want that in the bootloader otherwise the size of the bootloader is
massively increased. To get around this, when in tinytuner mode, the bootloader is no longer in the main() function, but in a
new function called bootloader. This allows main() to be placed with the tinyTuner code along with stdlib. The main function
simply calls the bootloader function.

When not using tinyTuner, the main function is the bootloader and stdlib is not linked meaning this change has no effect of
non-tiny chips.
*/
int main(void) __attribute__ ((section (".init9"))) __attribute__ ((naked));
void bootloader(void) __attribute__ ((naked)) __attribute__ ((noreturn)) BOOTLOADER_START_SECTION;

#else
#define BOOTLOADER_SECTION
/* Function Prototypes */
/* The main function is in init9, which removes the interrupt vector table */
/* we don't need. It is also 'naked', which means the compiler does not    */
/* generate any entry or exit code itself. */
int main(void) __attribute__ ((naked)) __attribute__ ((section (".init9")));
#endif
void putch(char) BOOTLOADER_SECTION;
uint8_t getch(void) BOOTLOADER_SECTION;
static inline void getNch(uint8_t) BOOTLOADER_SECTION; /* "static inline" is a compiler hint to reduce code size */
void verifySpace() BOOTLOADER_SECTION;
static inline void flash_led(uint8_t) BOOTLOADER_SECTION;
uint8_t getLen() BOOTLOADER_SECTION;
static inline void watchdogReset() BOOTLOADER_SECTION;
void watchdogConfig(uint8_t x) BOOTLOADER_SECTION;
#ifdef SOFT_UART
void uartDelay() __attribute__ ((naked)) BOOTLOADER_SECTION;
#endif
void appStart() __attribute__ ((naked)) BOOTLOADER_SECTION;
#ifdef USE_TINY_TUNER
void tinyTuner() __attribute__ ((naked)) __attribute__ ((noreturn));
#endif

#if defined(__AVR_ATmega168__)
#define RAMSTART (0x100)
#define NRWWSTART (0x3800)
#elif defined(__AVR_ATmega328P__)
#define RAMSTART (0x100)
#define NRWWSTART (0x7000)
#elif defined(__AVR_ATmega162__)
#define RAMSTART (0x100)
#define NRWWSTART (0x3800)
#elif defined (__AVR_ATmega644P__)
#define RAMSTART (0x100)
#define NRWWSTART (0xE000)
#elif defined(__AVR_ATtiny84__) || defined(__AVR_ATtiny85__)
#define RAMSTART (0x100)
#define NRWWSTART (0x0000)
#elif defined(__AVR_ATmega1280__)
#define RAMSTART (0x200)
#define NRWWSTART (0xE000)
#elif defined(__AVR_ATmega8__) || defined(__AVR_ATmega88__)
#define RAMSTART (0x100)
#define NRWWSTART (0x1800)
#endif

/* C zero initialises all global variables. However, that requires */
/* These definitions are NOT zero initialised, but that doesn't matter */
/* This allows us to drop the zero init code, saving us memory */
#define buff    ((uint8_t*)(RAMSTART))
#ifdef VIRTUAL_BOOT_PARTITION
#define rstVect (*(uint16_t*)(RAMSTART+SPM_PAGESIZE*2+4))
#define wdtVect (*(uint16_t*)(RAMSTART+SPM_PAGESIZE*2+6))
#endif

