SpenceKonde/ATTinyCore/tiny/bootloaders/optiboot/optiboot.c
typedef union {
    uint16_t integer;
    uint8_t array[2];
}twoByte;

/* main program starts here */
#ifdef USE_TINY_TUNER
int main(void) {
  //newMain = bootloader;
  //(*newMain)();
  bootloader();
}

void bootloader(void) {
#else
int main(void) {
#endif
  uint8_t ch;

#ifdef USE_TINY_TUNER
  ch = pgm_read_byte_near(ver);
  if(ch == 255) tinyTuner();
  ch = pgm_read_byte_near(ver+1);
  OSCCAL = ch;
#endif

  /*
   * Making these local and in registers prevents the need for initializing
   * them, and also saves space because code no longer stores to memory.
   * (initializing address keeps the compiler happy, but isn't really
   *  necessary, and uses 4 bytes of flash.)
   */
  register uint16_t address = 0;
  register uint8_t  length;

  // After the zero init loop, this is the first code to run.
  //
  // This code makes the following assumptions:
  //  No interrupts will execute
  //  SP points to RAMEND
  //  r1 contains zero
  //
  // If not, uncomment the following instructions:
  //cli();

  asm volatile ("clr __zero_reg__");
#if defined(__AVR_ATmega8__) || defined(__AVR_ATmega162__)
  SP=RAMEND;  // This is done by hardware reset, except on these ones
#endif

  // Adaboot no-wait mod
#ifdef __AVR_ATmega162__
  ch = MCUCSR;
  ch &= 0x0F;
  MCUCSR &= 0xF0;
#else
  ch = MCUSR;
  MCUSR = 0;
#endif
#if defined(__AVR_ATtiny84__) || defined(__AVR_ATtiny85__)
  if (!(ch & (_BV(EXTRF) | _BV(PORF)))) appStart(); //Power on reset loads bootloader as well - allows bootloader even if reset pin is disabled
#else
  if (!(ch & _BV(EXTRF))) appStart();
#endif
  
#if LED_START_FLASHES > 0
  // Set up Timer 1 for timeout counter
#if defined(__AVR_ATtiny85__)
  TCCR1 = _BV(CS13) | _BV(CS12); // div 2048 as it is only 8bit, so having to half TCNT1 value
#else
  TCCR1B = _BV(CS12) | _BV(CS10); // div 1024
#endif
#endif

#ifdef RS485_SUPPORT
  DE_DDR |= _BV(DE_BIT);
  DE_PORT &= ~_BV(DE_BIT);
#endif

#ifndef SOFT_UART
#ifdef __AVR_ATmega8__
  UCSRA = _BV(U2X); //Double speed mode USART
  UCSRB = _BV(RXEN) | _BV(TXEN);  // enable Rx & Tx
  UCSRC = _BV(URSEL) | _BV(UCSZ1) | _BV(UCSZ0);  // config USART; 8N1
  UBRRL = (uint8_t)( (F_CPU + BAUD_RATE * 4L) / (BAUD_RATE * 8L) - 1 );
#elif defined(__AVR_ATmega162__)
  UCSR0A = _BV(U2X0); //Double speed mode USART0
  UCSR0B = _BV(RXEN0) | _BV(TXEN0);
  UCSR0C = _BV(URSEL0) | _BV(UCSZ00) | _BV(UCSZ01);
  UBRR0L = (uint8_t)( (F_CPU + BAUD_RATE * 4L) / (BAUD_RATE * 8L) - 1 );
#else
  UCSR0A = _BV(U2X0); //Double speed mode USART0
  UCSR0B = _BV(RXEN0) | _BV(TXEN0);
  UCSR0C = _BV(UCSZ00) | _BV(UCSZ01);
  UBRR0L = (uint8_t)( (F_CPU + BAUD_RATE * 4L) / (BAUD_RATE * 8L) - 1 );
  
#endif
#endif

#if defined(__AVR_ATtiny84__) || defined(__AVR_ATtiny85__)
  // Set up watchdog to trigger after 2s to give software UART a better chance.
  watchdogConfig(WATCHDOG_2S);
#else
  // Set up watchdog to trigger after 1s
  watchdogConfig(WATCHDOG_1S);
#endif

  /* Set LED pin as output */
  LED_DDR |= _BV(LED);
  
#ifdef SOFT_UART
  /* Set TX pin as output */
  UART_DDR |= _BV(UART_TX_BIT);
  UART_PORT |= _BV(UART_TX_BIT); //set high!
#endif

#if LED_START_FLASHES > 0
  /* Flash onboard LED to signal entering of bootloader */
  flash_led(LED_START_FLASHES * 2);
#endif

  /* Forever loop */
  for (;;) {
    /* get character from UART */
    ch = getch();

    if(ch == STK_GET_PARAMETER) {
#ifndef USE_TINY_TUNER
      unsigned char which = getch();
      verifySpace();
    //for tiny chips with tuner code, dont bother sending optiboot version - saves code.
      if (which == 0x82) {
    /*
     * Send optiboot version as "minor SW version"
     */
        putch(OPTIBOOT_MINVER);
      } else if (which == 0x81) {
    /*
     * Send optiboot version as "major SW version"
     */
        putch(OPTIBOOT_MAJVER);
      } else 
#else
      getch();
      verifySpace();
      if(1)
#endif
      {
    /*
     * GET PARAMETER returns a generic 0x03 reply for
         * other parameters - enough to keep Avrdude happy
     */
        putch(0x03);
      }
    }
    else if(ch == STK_SET_DEVICE) {
      // SET DEVICE is ignored
      getNch(20);
    }
    else if(ch == STK_SET_DEVICE_EXT) {
      // SET DEVICE EXT is ignored
      getNch(5);
    }
    else if(ch == STK_LOAD_ADDRESS) {
      // LOAD ADDRESS
      twoByte newAddress; //By using a union which combines a uint16_t with an array of two uint8_t's, code is MUCH smaller.
      newAddress.array[0] = getch();
      newAddress.array[1] = getch();
      //
      //newAddress = getch();
      //newAddress |= /*(newAddress & 0xff) |*/ (getch() << 8);
#ifdef RAMPZ
      // Transfer top bit to RAMPZ
      RAMPZ = (newAddress.integer & 0x8000) ? 1 : 0;
#endif
      newAddress.integer += newAddress.integer; // Convert from word address to byte address
      address = newAddress.integer;
      //newAddress += newAddress;
      //address = newAddress;
      verifySpace();
    }
    else if(ch == STK_UNIVERSAL) {
      // UNIVERSAL command is ignored
      getNch(4);
      putch(0x00);
    }
    /* Write memory, length is big endian and is in bytes */
    else if(ch == STK_PROG_PAGE) {
      // PROGRAM PAGE - we support flash programming only, not EEPROM
      uint8_t *bufPtr;
      uint16_t addrPtr;

      getch();            /* getlen() */
      length = getch();
      getch();

#if !defined (__AVR_ATtiny84__) && !defined(__AVR_ATtiny85__)
      // If we are in RWW section, immediately start page erase
      if (address < NRWWSTART) __boot_page_erase_short((uint16_t)(void*)address);
      
      //For tiny chips, this is never possible
#endif

      // While that is going on, read in page contents
      bufPtr = buff;
      do *bufPtr++ = getch();
      while (--length);

#ifdef SOFT_UART
      // Read command terminator, start reply
      verifySpace(); //Have to do this before starting page erase otherwise we miss the last byte from avrdude as CPU is disabled for erase
#endif

      // If we are in NRWW section, page erase has to be delayed until now.
      // Todo: Take RAMPZ into account
#if !defined (__AVR_ATtiny84__) && !defined(__AVR_ATtiny85__)
      if (address >= NRWWSTART) __boot_page_erase_short((uint16_t)(void*)address);
#else
      //For tiny chips, this is always the case
      __boot_page_erase_short((uint16_t)(void*)address);
#endif
      
#ifndef SOFT_UART
      // Read command terminator, start reply
      verifySpace();
#endif

      // If only a partial page is to be programmed, the erase might not be complete.
      // So check that here
      boot_spm_busy_wait();

#ifdef VIRTUAL_BOOT_PARTITION
      if ((uint16_t)(void*)address == 0) {
        // This is the reset vector page. We need to live-patch the code so the
        // bootloader runs.
        //
        // Move RESET vector to WDT vector
        twoByte vect;
        vect.array[0] = buff[0];
        vect.array[1] = buff[1];
        rstVect = vect.integer;
        twoByte wdtTempVect;
        wdtTempVect.array[0] = buff[8];
        wdtTempVect.array[1] = buff[9];
        wdtVect = wdtTempVect.integer;
        vect.integer -= 4; // Instruction is a relative jump (rjmp), so recalculate.
        buff[8] = vect.array[0];
        buff[9] = vect.array[1];

        // Add jump to bootloader at RESET vector
        buff[0] = 0xdf;
        buff[1] = 0xce; // rjmp 0x1dc0 instruction - smaller bootloader size, so moved bootloader up by 1 page
        
